---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomAverageIllumination
source: html/5d633c8d-de1f-7b9d-8f00-4c725ce13c81.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomAverageIllumination Property

"Average Estimated Illumination"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecRoomAverageIllumination { get; }
```